{
    "posts":[
        {
            "index": 0,
            "title": "2022: Yearly Review",
            "author": "Blessing Boaslah",
            "date": "DEC 30, 2022",
            "hook": "Hello, allow me to delve into what my 2022 has been like, and the lessons I've learned. Hopefully you'd find something that you can relate to.",
            "image": "/assets/2022-cover2.jpg",
            "post": "Hi, this is my first public writing, which makes it an official welcome to Blessing's Journal.<br>Since 2019, I started writing my yearly reviews at the end of every year. This year, I decided to make my review public but, not with the personal details though; as that won't be necessary.<br>Instead, I seek to give you a bigger picture of my year.<br>So here's it, let's begin.<br><br>Sitting silently on my bed at 9:50 pm, December 19, 2022, as I watch the year speedily fade away.<br>I'm almost drowning in my thoughts; and struggling to make peace with them. All of a sudden, I get reminded that 'this is not the end'. <br>The end of 2022 is not the end of time. This reminder came just in time and saved me from getting deeply drowned.<br><br>A few days before that night, I had been feeling guilty for all the goals I didn't accomplish, all the bits of mistakes I made, and all the things I should have done; but didn't do.<br>Moreover, I was finding it hard to feel genuinely grateful. My thoughts were clouded by the many things that didn't go as I planned. I lost sight of the bigger picture. <br><br>Later that night, I took a tour down memory lane and found some of the 'obvious' reasons that I'll always be grateful for - being alive, my family, my friends, my work, and everyone around me.<br><br>Recognizing how important these little blessings are, I arrived at a familiar place. A place of peace and gratitude, and my eyes opened to more than just the now, more than just the plans that didn't work out; my beautiful brown eyes opened to <b>everything</b>, 'the <b>everything</b>'!<br><br>However, I decided to go beyond what might seem to be the obvious reasons for my peace and gratitude. I needed to seek more. Hence, I went back to the beginning, how it(2022) all started, to find more reasons. Thankfully for me, I've been keeping track of every moment of 2022 in a physical journal. So I ran right to it and got all the details of my year. I did cringe a lot more than I expected, but that's perfectly okay.<br><br> In a nutshell, 2022 has been the wildest year for me so far. I explored a couple of new things, made tons of mistakes, learned lots of lessons, discovered some secrets, and grew a lot.<br><br> Not to bore you with the cringey details, here's a list of a few things I gathered from my 2022.<br><br><ul><li>I don't need to wait for a new year to make necessary changes to my routines. It's never too late to do what I want to do; I can start now. And of course, I have more years to keep getting better and working towards a fulfilling end.</li><br><li>Having assumptions isn't quite wrong but, acting based on mere assumptions can lead to an unfavorable end. It's better to seek reality.</li><br><li>It is more fulfilling to accept reality for what it is, and not what it should be. Therefore providing what it demands.</li><br><li>Everything does happen for a reason. Reasons which are not always known initially. But patience is a virtue; and with patience, the pieces of the puzzel will come together, eventually.</li><br><li>There are no shortcuts to true success and fulfillment. Shortcuts only lead to short-term victories. To have a fulfilling end, one must go through all the stages needed.</li><br><li>Good things don't come from desperation, they don't happen in an instant, they take time, and they go through processes that are not always easy but, necessary.</li><br><li>It's healthy and rewarding to be calm and feel good regardless of the stage or phase of life.</li><br><li>It's not easy to have a balance in life but, it's an amazing and ultimately favorable thing; and it's achievable.</li><br><li>It is pleasing to know when to say NO! Not just to what is wrong. But also, to what appears to be right but, not necessary for the present reality of life.</li><br><li>Life is fascinating in so many ways. In ways that it can be <b>everything</b> and still maintain its absolute nature of being unpredictable.</li><br><li>As a child of God, it is better to let go and let God handle the things that are out of control. <b>God knows best</b>!</li></ul><br><br>Dear lovely reader, for all the experiences that led to now, and the lessons learned along the way, I'm genuinely grateful!<br><ul><li>I'm grateful for being able to live and to live fully in every moment, not escaping the unfavorable ones but, finding purpose and meaning in them.</li><br><li>I'm grateful for being able to live even when I got tired of living.</li><br><li>I'm grateful for <b>EVERYTHING</b>, 'the <b>EVERYTHING</b>' of life that I've lived in 2022</li></ul><br>",
            "duration": "3 min read",
            "category": "Personal",
            "comments": []
        },
        {
            "index": 1,
            "title": "Perfection Does Exist",
            "author": "Blessing Boaslah",
            "date": "...",
            "hook": "We'd all agree that 'perfection' doesn't exist, but guess what? I think I found out something. Hear me out. ",
            "image": "/assets/perfection-post-cover.jpg",
            "post": "Coming soon",
            "duration": "...",
            "category": "General",
            "comments": []
        },
        {
            "index": 2,
            "title": "Making The World Better",
            "author": "Blessing Boaslah",
            "date": "...",
            "hook": "Oh, our World! What a mess we've made, right? Could it get better? Can we fix this? Let's find out together.",
            "image": "/assets/mtwb-cover.jpg",
            "post": "Coming soon",
            "duration": "...",
            "category": "General",
            "comments": []
        }

    ],
    "love": "<3"
}